<?php
// ----------------------------------------------------------------------
// | 注意 修改配置项 | 请 重启 框架 主进程 | 不然 资源 没有加载进去
// ----------------------------------------------------------------------
return [
    //默认配置
    'default' => [
        //获取 token
        -1 => '系统繁忙，此时请开发者稍候再试',
        0 => '请求成功',
        40001 => 'AppSecret错误或者AppSecret不属于这个公众号，请开发者确认AppSecret的正确性',
        40002 => '请确保grant_type字段值为client_credential',
        40164 => '调用接口的IP地址不在白名单中，请在接口IP白名单中进行设置。（小程序及小游戏调用不要求IP地址在白名单内。）',
        89503 => '此IP调用需要管理员确认,请联系管理员',
        89501 => '此IP正在等待管理员确认,请联系管理员',
        89506 => '24小时内该IP被管理员拒绝调用两次，24小时内不可再使用该IP调用',
        89507 => '1小时内该IP被管理员拒绝调用一次，1小时内不可再使用该IP调用',
        //获取 用户信息
        40003 => '用户的openid与(AppId和AppSecret)对应不上,也就是 AppId,AppSecret,openid 要成套',
    ],
];